app/views/clubs/show.html.erb

</div>
  <% @club.campaigns.each do |campaign| %>
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."club_id" = ?  [["club_id", 2]]

                  <p>Description: <%= campaign.description %></p>
                  <p>Pledges: <%= campaign.pledges.count %></p>
---
SELECT COUNT(*) FROM "pledges" WHERE "pledges"."campaign_id" = ?  [["campaign_id", 1]]