app/views/students/index.html.erb

          <td><%= student.tiltAccNum %></td>
          <td><%= student.pledges.count %></td>
---
SELECT COUNT(*) FROM "pledges" WHERE "pledges"."student_id" = ?  [["student_id", 1]]