app/views/students/show.html.erb

SELECT  1 AS one FROM "pledges" WHERE "pledges"."student_id" = ? LIMIT 1  [["student_id", 1]]
---
    <p>
      <% if @student.pledges.any? %>