app/controllers/campaigns_controller.rb

  def index
    #redirect_to CASClient::Frameworks::Rails::Filter.redirect_to_cas_for_authentication(self)
    @campaigns = Campaign.all
---
SELECT "campaigns".* FROM "campaigns"

  def show
      @campaign = Campaign.find(params[:id])
---
SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @campaign = current_club.campaigns.build(campaign_params)

    respond_to do |format|
      @campaign.pledges = []
      if @campaign.save
---
INSERT INTO "campaigns" ("name", "goalMoney", "clubMoney", "description", "start_date", "end_date", "club_id", "currentMoney", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @campaign.update(campaign_params)
---
UPDATE "campaigns" SET "picture" = ?, "updated_at" = ? WHERE "campaigns"."id" = ?  [["picture", "taylor.jpg"], ["updated_at", "2015-05-08 19:41:15.775825"], ["id", 1]]