app/controllers/club_session_controller.rb

SELECT  "clubs".* FROM "clubs" WHERE "clubs"."email" = ? LIMIT 1  [["email", "ivyclub@princeton.edu"]]
---
  def create
    club = Club.find_by(email: params[:club_session][:email].downcase)