app/controllers/clubs_controller.rb

  def show
    @club = Club.find(params[:id])
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT 1  [["id", 2]]

  def edit
    @club = Club.find(params[:id])
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT 1  [["id", 2]]

    def set_club
      @club = Club.find(params[:id])
---
SELECT  "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT 1  [["id", 2]]