app/controllers/sessions_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."netid" = ? LIMIT 1  [["netid", "sarge"]]
INSERT INTO "students" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "srw@princeton.edu"], ["created_at", "2015-04-26 17:31:44.883479"], ["updated_at", "2015-04-26 17:31:44.883479"]]
---
  def create
    student = Student.find_by(netid: params[:student_session][:netid])
    #if username
     #   redirect_to home_url

    if student
      # Log the user in and redirect to the user's show page.
      student_log_in student
      redirect_to home_url
    else
      # Create new student account.
      @student = Student.new(student_params)
      if @student.save