app/controllers/students_controller.rb

INSERT INTO "students" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Rachel Margulies"], ["email", "rachelbm@princeton.edu"], ["created_at", "2015-04-26 17:10:47.778820"], ["updated_at", "2015-04-26 17:10:47.778820"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save