app/views/campaigns/index.html.erb

              <h3 class="brand-smaller"><strong>$<%= campaign.currentMoney %></strong> raised of $<%= campaign.goalMoney.to_i - campaign.clubMoney.to_i %> goal</h3>
                <% if (campaign.pledges.count == 1) %>
---
SELECT COUNT(*) FROM "pledges" WHERE "pledges"."campaign_id" = ?  [["campaign_id", 1]]